[
  
  {
    "image": "https://iarco.org/assets/participant/2024/ShafiBinSultan.jpg",
    "name": "Shafi Bin Sultan",
    "institution": "St.Joseph Higher Secondary School & College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Gold Medalist",
    "rating": 5,
    "review": "The journey with IARCO has been nothing short of transformational, with opened doors that I never thought possible, encouraging us to excel in every step through bootcamp sessions. It provided me a ground to showcase my abilities, challenged me for critical thinking, and aspired me to aim higher. I am eternally grateful that I can be in a place to share my experiences and contribute to encouraging others, because by now, too, I've been encouraged enough by the stories of so many before me. Long story short, Hats off to IARCO!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/adira.jpg",
    "name": "Adira Safwan",
    "institution": "Maple Leaf International School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Silver Medalist",
    "rating": 5,
    "review": "As the Silver Prize winner of IARCO 2024, I am immensely grateful for the incredible opportunity to practice and showcase everything I had learned, especially from the Youth Research Journal program I was a student of prior. Participating in this competition significantly honed my research skills, and the excellent workshops conducted by some of the brightest minds in the field were instrumental in my success. The event was very well-structured, with concise and detailed guidelines, ensuring that every resource we needed was readily available--- from guidelines, lectures and even examples of what was expected of us as participants. This inclusive approach made it accessible even for participants with little to no prior experience in research, encouraging everyone to give it a shot. One of the most exciting parts of the competition for me was creating the video pitch. It allowed me to present the significance of my chosen topic and put into practice everything I had worked on in my proposal. It was a perfect opportunity to merge creativity with research and demonstrate my insights in a compelling way. Truthfully, I tend to work last-minute, and there were moments when I doubted whether I’d even make it to the top 10. Winning Silver felt surreal and deeply rewarding. I am endlessly thankful to IARCO for providing this platform. I hope this inspires others to step out of their comfort zones and explore the exciting world of research."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/FilzahDahiyah.jpeg",
    "name": "Andi Filzah Dahiyah Liana",
    "institution": "Man 2 Kota Makassar",
    "category": "Junior",
    "country": "Indonesia",
    "year": "2024",
    "rating": 5,
    "result": "Bronze Medalist",
    "review": "Participating in IARCO 2024 has been an incredibly valuable and meaningful experience for me. The event was well organized, and I truly appreciate the opportunity to showcase my research and connect with other brilliant minds from various fields. Receiving the certificate of recognition was an honor, and it motivates me to continue striving for excellence in research. The supportive and professional atmosphere created by the organizers made the entire process smooth and enjoyable. I believe IARCO has a significant positive impact by inspiring researchers and fostering innovation. Thank you for hosting such an inspiring event, and I hope IARCO continues to thrive and support many more researchers in the future."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/SanjanaHasan.png",
    "name": "Sanjana Hasan",
    "institution": "Khulna University of Engineering & Technology",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Gold Medalist",
    "rating": 5,
    "review": "No matter how many lemons life gives you, keep making lemonade with a smile. There will be moments when it feels overwhelming and others that fill you with joy—that’s the nature of life. Be grateful not only for what you’ve achieved but also for what you haven’t, as it may not have been meant for you. Gratitude and forgiveness go hand in hand. Show kindness and compassion because you never truly know what others are going through. Even if you reach great heights, remain humble and treat everyone with respect. Life will bring new people and experiences your way—welcome them and learn from each one. Mistakes are not reasons for grief; they are valuable lessons. If you act unjustly or behave rudely toward someone, sincerely apologize without delay. Remember, it’s not your achievements but your behavior that truly defines your character. And lastly, never forget—no matter what challenges come your way, you must keep going. Never give up."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/EbtisamJawad.jpeg",
    "name": "Mohammad Ebtisam Jawad",
    "institution": "Premier University, Chittagong",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Silver Medalist",
    "rating": 5,
    "review": "Participating in the 'International Academic Research Competition' was a learning session in my life. I took it as a challenge to see my capabilities. In my IARCO journey, I learnt a lot from Azmain bhaiya and Sanaul bhaiya. A big congratulations to the whole IARCO team for arranging this competition successfully. I always believe, The result is not in my hand, but how much effort and dedication should be given is always in my hand."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ARLisan.JPG",
    "name": "Arafat Rahman",
    "institution": "American International University Bangladesh",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Bronze Medalist",
    "rating": 5,
    "review": "I’m honored to have my journey featured by IARCO! Participating in the research proposal competition was a challenging yet rewarding experience. Finishing 3rd was a proud moment, as it reflected my dedication and hard work. IARCO provided me with an incredible platform to showcase my ideas and grow both personally and professionally. Their support and encouragement motivated me to push my limits and think creatively. I hope my story inspires others to take on challenges and make the most of the opportunities around them. Thank you, IARCO, for being a part of my journey!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ApurboKumar.jpg",
    "name": "APURBO KUMAR",
    "institution": "Bangladesh University of Engineering and Technology",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Excellent"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/AfiaAnjumAboni.jpg",
    "name": "Afia Anjum Aboni",
    "institution": "Rajuk Uttara Model College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "By doing the IARCO boot camp, I learned about the procedure of doing research comprehensibly. Our mentor was very insightful and patient as he diligently led us through the research steps. As an absolute beginner, I now have a clear roadmap of the things I need to do or avoid when I think of starting my research paper!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/Ha-mimRahman.jpg",
    "name": "Ha-mim Rahman",
    "institution": "Notre Dame College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "The program has been awesome overall."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/Hossain_ Siam.png",
    "name": "Md Siam Hossain",
    "institution": "University of Dhaka",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "I’ve learned so much throughout this process. Writing a research proposal is not something typically covered in our universities, so this boot camp has been invaluable. It provided me with the opportunity to learn essential techniques from a qualified instructor and offered insights into managing a PhD effectively. I truly appreciate what IARCO is doing to support us in this journey."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/LamisaManha.jpg",
    "name": "Lamisa Manha Aditee",
    "institution": "BRAC University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "Creating a research proposal is the first step to do start a research project. I’m glad that I decided to participate in IARCO, as it has given me a clear understanding of how to get started in research. Coming from a STEM background, this experience has been especially helpful for me."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/IshmamHaque.jpeg",
    "name": "SM Ishmam Tahsin Haque",
    "institution": "Maple Leaf International School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "IARCO helped me delve deeper into understanding the process of writing a presenting a research proposal and simultaneously competing with other talented participants."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/TAZRIANISLAMSUBHA.jpeg",
    "name": "Tazrian Islam Subha",
    "institution": "South Breeze School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "It helped me gain lots of insights on how to write a research proposal. All information was really amazing and crucial for my future studies. I loved the boot camps."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/XeonNasif.jpg",
    "name": "Xeon Nasif",
    "institution": "Notre Dame College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "The lessons have undoubtedly provided us with the necessary skills to write research proposals effectively."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/EshratJahan.jpg",
    "name": "Eshrat Jahan",
    "institution": "University of Dhaka",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Educative and well organised."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/GloryJewel.jpg",
    "name": "Glory Jewel",
    "institution": "Mohammadpur Preparatory School And College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "As I had an desire for researching. It helped me to get an idea about the research proposal . Really enjoyed to hear from the experienced persons."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/CarolineGomes.jpg",
    "name": "Caroline Gomes",
    "institution": "University of Dhaka",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO bootcamp has helped me a lot to get deep insights into the world of research. I have learnt the basics of research. For example, how to write a research proposal, the methodology of research. The best part of this event was the study abroad part."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/sanjidaafrin.jpg",
    "name": "Sanjida Afrin",
    "institution": "Bangladesh University of Engineering & Technology (BUET)",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "This bootcamp is very organized. It helps me understand and find some significant issues which will help me regarding research."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/sameerakhan.jpeg",
    "name": "Sameera Khan",
    "institution": "Notre Dame University Bangladesh",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "Joining the IARCO Bootcamp  not only did it deepen my understanding of research proposal but it also equipped me with practical skills that I’m already applying in my studies. "
  },
  {
    "image": "https://iarco.org/assets/participant/2024/TafhimIslam.jpg",
    "name": "Tafhim Islam",
    "institution": "Saint Joseph Higher Secondary School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO taught me the basics of research and it initiated me on learning through papers and journals. I would love to be with the youth research journal in future. I also want to thank everyone including the organizer, the lecturers and other persons involved for their earnest efforts. "
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ZubairMustafa.jpg",
    "name": "Zubair Mustafa",
    "institution": "Daffodil International University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "I just loved YRJ how they have organized the things hats off!!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/UmaizaJaveria.jpg",
    "name": "Umaiza Javeria",
    "institution": "William Carey Academy",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "The IARCO bootcamp helped me the learn fundamentals of research and what it really is. It also cleared a lot of misconceptions surrounding research and who can do it. "
  },
  {
    "image": "https://iarco.org/assets/participant/2024/MahiyaMannan.jpg",
    "name": "Mahiya Mannan",
    "institution": "Heritage School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO Bootcamp was an amazing experience!  Learned soo much"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/UmmeyZahida.jpg",
    "name": "Ummey Zahida",
    "institution": "University of Chittagong ",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Excellent initiative to aware students about research and related things with."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/NazmoonNahar.jpg",
    "name": "Nazmoon Nahar",
    "institution": "Sher-e-Bangla Agricultural University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO bootcamp is a great initiative to encourage the students about research. It is not only a competition but also a platform to learn the all of the basic of research and find out all the curious question about research. By writing a proposal, anyone can be more confident with practical learning and able to do a better future researcher."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/TriprantaSaha.jpg",
    "name": "Tripranta Saha",
    "institution": "American International University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Yes, that was great. Through this bootcamp, I got more information about research and found my interest."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/JAYEETABISWAS.jpg",
    "name": "Jayeeta Biswas",
    "institution": "Khulna University of Engineering and Technology",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Yes, the IARCO Bootcamp would be a great fit for you! Even as if I'm new to research proposals, the bootcamp is designed to guide beginners through the process. It typically covers all the essentials, like understanding research structure, setting clear objectives, and organizing your ideas effectively.It was instrumental in building my research skills. Through structured sessions, I learned how to effectively conduct research, critically analyze information, and develop well-organized research proposals. The guidance on proposal writing, from framing research questions to setting clear objectives, was invaluable. Highly recommended for anyone looking to deepen their research skills and learn the art of proposal writing!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/SarhanAlamKhan.jpeg",
    "name": "Sarhan Alam Khan",
    "institution": "Scholastica",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "The bootcamps was quite informative. I loved how they record each of their sessions and give the resources related to research. This is a  life long learning experience."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ManjaryHowlader.jpg",
    "name": "Manjary Howlader",
    "institution": "Viqarunnisa Noon School & College",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "As someone who felt overwhelmed by the abundant research-related materials available online, the bootcamp was very concise and easy to understand."
  }
]
