[
      {
        "image": "https://iarco.org/assets/participant/2025/ClaraLau.jpg",
        "name": "Clara Lau ",
        "institution": "International Christian School ",
        "category": "Junior",
        "country": "China",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "In my opinion, IARCO is a great research competition that gives students the opportunity to advance in research skills and other educational skills. It is truly a great experience! "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/NipunaGinige.jpg",
        "name": "Nipuna Ginige",
        "institution": "Princeton University",
        "category": "Senior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 3,
        "review": "A lot of videos and a lot of resources are available to you, which I found really helpful for getting started on research despite having no prior experience."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/Revision.jpeg",
        "name": "Gales Epifanio Pérez Fernández",
        "institution": "Colegio de Alto Rendimiento (COAR) - San Martín",
        "category": "Junior",
        "country": "Peru",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "The International Academic Research Competition (IARCO) is an inspiring opportunity for students to share their ideas on a global stage. What makes it so special is how open it is to every discipline—from science and technology to the humanities—giving everyone a chance to shine. The guidelines are clear and fair, making sure each proposal is judged on originality, creativity, and solid research methods. I really admire how it encourages students to follow high academic standards while still being innovative"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/VaruniHK.jpeg",
        "name": "Varuni H K ",
        "institution": "PES University ",
        "category": "Senior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 3,
        "review": "liked the quality "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/HudaHassan.jpg",
        "name": "Huda Hassan",
        "institution": "Zaitoon international campus",
        "category": "Junior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 3,
        "review": "wonderful experience"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/Hrishitaa.jpeg",
        "name": "Hrishitaa P",
        "institution": "Christ Junior College",
        "category": "Junior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 3,
        "review": "Great opportunity"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/KellyPierre.jpg",
        "name": "Kelly-Emmanuel Pierre",
        "institution": "Charlotte Catholic High School",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "Very clear cut guidelines, access to the winning proposals helped me structure my own."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/MrinalYalageri.jpg",
        "name": "Mrinal Yalageri",
        "institution": "Obra D. Tompkins High School",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "I think IARCO is a great organization, and I truly am appreciative of what the organization stands for.  "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/XusenovFirdavsJamshid.JPG",
        "name": "Firdavs Xusenov",
        "institution": "Presidential School in Navoi",
        "category": "Junior",
        "country": "Uzbekistan",
        "year": "2025",
        "result": "Finalist",
        "rating": 3,
        "review": "IARCO offered me a chance of experiencing a researching sphere, which was my first experience in such stuff."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/HongAnhLai.jpg",
        "name": "Lai Hong Anh ",
        "institution": "Chu Van An National High School for the Gifted ",
        "category": "Junior",
        "country": "Vietnam",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "Participating in IARCO has been an incredibly valuable experience for me. The competition is not just an international academic stage, but also a training ground for developing serious and rigorous research skills. What impressed me most was the high standard of academic integrity, especially the requirement to follow IEEE citation style and the use of iThenticate for plagiarism checks. This gave me a chance to engage with international research standards at a very early stage as a high school student. One of the most important lessons I learned is that research is not only about gathering information, but also about asking the right questions, analyzing data logically, and presenting findings as a coherent argument that can contribute to the academic community. IARCO made me realize that creativity must go hand in hand with discipline in order to carry real weight. The most ideal part of this journey was the feeling of truly stepping into the role of a “young researcher” — being challenged to think critically, to test methodologies, and to communicate ideas with clarity and purpose."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/Julia.jpeg",
        "name": "Julia Castilho de meireles",
        "institution": "Gap year student",
        "category": "Junior",
        "country": "Brazil",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "IARCO was a great experience, offering well-structured workshops that were both engaging and informative. The assessments were fair and thoughtfully designed, providing valuable feedback and helping participants strengthen their research skills."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/ManuelSotoadvis.jpg",
        "name": "Manuel Soto Advis",
        "institution": "Deutsche Schule Sankt Thomas Morus",
        "category": "Junior",
        "country": "Chile",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "Participating in IARCO has been an inspiring and educational experience. The competition not only strengthened my research skills but also gave me the opportunity to explore global issues, develop original ideas, and connect with an international community of young researchers. IARCO truly empowers students to grow as thinkers and innovators"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/Katharina.jpeg",
        "name": "Katharina Alt",
        "institution": "Munich International School",
        "category": "Junior",
        "country": "Germany",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO is a great competition. A lot of resources and guidance were provided and I really enjoyed researching about my own topic of interest. Would definitely recommend!"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/GamalAhmed.jpg",
        "name": "Gamal Ahmed Gamal El-Din Abdelwahab ",
        "institution": "Ismailia stem high school",
        "category": "Junior",
        "country": "Egypt",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "I really Gained experience in writing and presenting research proposal"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/HannaEmily.jpeg",
        "name": "Hanna Emily Salim",
        "institution": "Springfield School",
        "category": "Junior",
        "country": "Indonesia",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "It has been a wonderful experience. The workshops really help, especially in crafting and developing the structure of my research proposal"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/KurniaRamadhani.jpg",
        "name": "Kurnia Ramadhani",
        "institution": "Man Insan Cendekia OKI",
        "category": "Junior",
        "country": "Indonesia",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO 2025 provides an amazing platform for young researchers around the world to share innovative ideas and gain international exposure. It truly motivates students like me to pursue scientific research with passion and purpose."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/ManuelaAilinSutanto.jpg",
        "name": "Manuela Ailin Sutanto",
        "institution": "ACS Jakarta",
        "category": "Junior",
        "country": "Indonesia",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "I'd honestly say that it was a good experience and allowed me to learn a lot of things that I was passionate about. I wish to do further research on oxytocin in university."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/RiyantiPandanwangi.jpeg",
        "name": "Riyanti Pandanwangi ",
        "institution": "MAN 8 Jakarta",
        "category": "Junior",
        "country": "Indonesia",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "It was a remarkable experience to participate in an international research bootcamp. I learned a lot about how to write good and proper proposals especially in the research methodologies part. This is also the first time I've been taught by professors. There are even assessments to test our understanding of the material provided. I'll definitely recommend others to take part in this bootcamp! "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/ArnavMangla.png",
        "name": "Arnav Mangla",
        "institution": "DPS International Edge, Gurgaon",
        "category": "Junior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "Participating in the International Academic Research Competition (IARCO) has been an inspiring and transformative experience. The process challenged me to think beyond conventional boundaries and design research that is both original and globally relevant. IARCO’s focus on integrity, clarity, and innovation gave me the chance to merge behavioral finance with social media analysis to study IPO markets in India. More than a competition, it felt like a launchpad that strengthened my research skills and confidence to pursue bold ideas."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/FathimathShahanas.jpg",
        "name": "Fathimath Shahanas ms",
        "institution": "ZAITOON INTERNATIONAL CAMPUS",
        "category": "Junior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "Participating in IARCO has been a truly wonderful experience. The entire process – from preparing the research to receiving feedback – was very well organized and enriching. I really liked how the competition encouraged originality, critical thinking, and proper academic formatting, which helped me grow as a researcher. The judging guidelines were clear and professional, and the opportunity to share ideas on a global platform made the experience even more valuable. Overall, IARCO has provided me with a lot of learning, exposure, and confidence, and I would highly recommend it to other students interested in research."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/Vedant.jpg",
        "name": "Vedant Varhaadkar",
        "institution": "Inventure Academy",
        "category": "Junior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "The research program was well structured, it spiked my curiosity, encouraging me to think critically and explore concepts beyond the surface level. Which made the learning experience both engaging and stimulating. Although the program was slightly short and limited in depth research, it was highly enjoyable."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/DhruvinBhandari.jpg",
        "name": "Dhruvin Bhandari",
        "institution": "Divine Child International School",
        "category": "Junior",
        "country": "India",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "IARCO is an amazing platform to showcase your research skills, and even if you don't have any prior experience in research, the boot camps provided are very helpful to help build the skills required to compete in the competition "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/AoiMase.jpeg",
        "name": "Aoi Mase",
        "institution": "Mita International School of Science",
        "category": "Junior",
        "country": "Japan",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "I really enjoyed making my proposal. Thank you!"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/MyeongjunSong.jpg",
        "name": "Myeongjun Song",
        "institution": "Daegu Science High School for the Gifted",
        "category": "Junior",
        "country": "South Korea",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "My experience with IARCO has been nothing short of inspiring. This competition made me bring fresh ideas, solid research, and a real passion for advancing the field. If innovation had a home, IARCO would definitely have the keys."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/InsanaKarymsakova.jpeg",
        "name": "Insana Karymsakova",
        "institution": "Nazarbayev Intellectual School of Science and Mathematics in Nauryzbay District of Almaty",
        "category": "Junior",
        "country": "Kazakhstan",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "Participating in the International Research Competition was an exciting and eye-opening experience for me. It allowed me to present my work on a global stage, learn from other participants’ innovative ideas, and receive helpful feedback from judges and experts. The competition helped me strengthen my research, improve my presentation skills, and build connections with like-minded peers from around the world."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/EssHsam.png",
        "name": "Houssam Essaadi",
        "institution": "Lycée Ibn Batouta",
        "category": "Junior",
        "country": "Morocco",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO gave me the chance to truly discover what real research feels like, asking my own questions, building my own systems, and learning how to think with clarity and purpose."
    },
    {   
        "image": "https://iarco.org/assets/participant/2025/PantipaChotirattanapitak.jpg",
        "name": "Punlawin Chotirattanaphithak",
        "institution": "Wellington College International School Bangkok",
        "category": "Junior",
        "country": "Thailand",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "My experience with IARCO shows that it is a truly competitive platform with clear and rigorous rules, ensuring fairness and high standards for all participants."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/NourHicham.jpeg",
        "name": "Nour El Houda Hicham",
        "institution": "Belgian school of Rabat ",
        "category": "Junior",
        "country": "Morocco",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "I really enjoyed participating in IARCO. The process is very well structured, and the instructions provided are clear, which makes preparing and submitting a research project much easier. The evaluation criteria are detailed and precise, helping participants understand exactly what is expected for each section, whether it’s the research problem, methodology, or literature review. The guidance provided throughout the process is very helpful, and I feel that it encourages creativity, critical thinking, and thorough research. Overall, IARCO is a very well-organized program that motivates students to produce high-quality, original work."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/ShivyBoy.jpg",
        "name": "Shivansh dixit ",
        "institution": "Indian school al ghubra ",
        "category": "Junior",
        "country": "Oman",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "This competetion helped me learn a lot about research papers, physics and my own curriculum. It pushed me forward. "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/WyzBetonio.png",
        "name": "Reena Wyz Valois Betonio",
        "institution": "Philippine Science High School SOCCSKSARGEN Region Campus",
        "category": "Junior",
        "country": "Philippines",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "I am very grateful for the opportunity to join IARCO, especially since I was able to register on the last day of the extended registration. The pre-recorded classes were informative and easy to follow, and they really helped me learn how to write and structure a research proposal. IARCO not only prepared me for competition but also inspired me to see research as a way to create impact."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/xyrus.jpg",
        "name": "Xyrus D. Baloloy",
        "institution": "Camarines Norte Senior High School",
        "category": "Junior",
        "country": "Philippines",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "Complete and Concise Information Dessemination but Lack of Engagement"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/BareeraAli.jpg",
        "name": "Bareera Ali",
        "institution": "Beaconhouse School System",
        "category": "Junior",
        "country": "Pakistan",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "“IARCO provides excellent guidance for students and researchers. Their resources help simplify complex topics, support clear writing, and make academic projects easier to manage. It’s a great platform for learning and improving research skills.”"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/IbrahimRaja.jpg",
        "name": "Muhammad Ibrahim Raja",
        "institution": "Beaconhouse College Programme Margalla Campus, Islamabad",
        "category": "Junior",
        "country": "Pakistan",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO first deep tested our knowledge on research and associated statistics knowledge. It then provided us access to materials such as how to write a research proposal, a few examples, sources to conduct research and bootcamps with professional researchers. This was a first time yet unique experience which gave me valuable insights about research and would open ways to future opportunities."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/AbdullahSalman.png",
        "name": "Mohammad Abdullah Salman ",
        "institution": "The City School PAF Chapter ",
        "category": "Senior",
        "country": "Pakistan",
        "year": "2025",
        "result": "Finalist",
        "rating": 4,
        "review": "A great platform to showcase your knowledge and technical skills across various disciplines of Science and Technology. "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/BogdanBora.jpeg",
        "name": "Bora Bogdan Alex",
        "institution": "National College „Emil Racoviță”",
        "category": "Junior",
        "country": "Romania",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "I think it is a well organized competition with unique concepts like the bootcamps and I am glad I have the chance to be part of this year's edition."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/ChadaphatsananChumchuen.jpeg",
        "name": "Chadaphatsanan chumchuen",
        "institution": "Lanzhou university ",
        "category": "Senior",
        "country": "Thailand",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "In my opinion, this competition is an excellent opportunity because it welcomes a diverse range of students from various backgrounds to participate. While the organisers clarify that this is a competition rather than a formal course, the professors involved have enriched our experience by imparting a considerable amount of valuable knowledge regarding the research process. Their insights and guidance have not only clarified theoretical concepts but also equipped us with practical skills that will be beneficial in our academic and professional journeys. This blend of competition with an educational framework makes the experience both challenging and rewarding. I am uncertain about advancing to the second round, but I would like to express my sincere gratitude to the organizers for hosting such a remarkable competition. Thank you for the opportunity!"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/PawarateVhaiprom.jpg",
        "name": "Pawarate Vhaiprom",
        "institution": "Sirindhorn School",
        "category": "Junior",
        "country": "Thailand",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "Taking part in this competition has been an incredibly rewarding experience. Along the way, I explored new ways to communicate ideas, strengthened my research and problem-solving abilities, and learned to approach challenges with creativity and confidence. Beyond completing the project, it became a chance to grow, discover my strengths, and push my own boundaries. This journey has truly been both inspiring and memorable."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/SrihaanEdla.jpeg",
        "name": "Srihaan Edla",
        "institution": "Vista Del Lago",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "It has been a great process and the bootcamps have been very helpful."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/nynaahuja.JPG",
        "name": "Nayna Ahuja",
        "institution": "Lawrence E. Elkins School",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "I had fun researching on a topic of my choice."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/JiahnaRhee.png",
        "name": "Jiahna Rhee",
        "institution": "Villa park High School",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO 2025 was very inspiring and motivational. I'm so glad I had this opportunity to research what I'm interested in. Organization was smooth with exact deadlines, creating a safe environment to work in! Thank you so much!"
    },
    {
        "image": "https://iarco.org/assets/participant/2025/Anubhavmahapatra.jpg",
        "name": "Anubhav Mohapatra ",
        "institution": "Prosper High School",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "Great experience researching on a topic of interest and becoming a field expert on a particular matter of expertise! I learned a lot about formal research and crafting a comprehensive independent research project along the way, taking various insights/learnings into consideration and for further exploration. "
    },
    {
        "image": "https://iarco.org/assets/participant/2025/BenZhang.jpg",
        "name": "Ben Zhang",
        "institution": "Milpitas High School",
        "category": "Junior",
        "country": "United States",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "Participating in the International Academic Research Competition (IARCO) has been one of the most inspiring and transformative experiences of my life. From the very beginning, I felt encouraged to push myself, explore ideas I am truly passionate about, and approach challenges in ways I never had before. This journey has been especially meaningful to me because it connects to a challenge I know all too well: I suffered a serious ACL injury that required surgery, followed by a year of grueling rehabilitation. That experience was both physically and emotionally taxing, and it ignited in me a deep determination not only to recover but also to prevent others from enduring the same hardships. The guidance, bootcamps, and feedback I received through IARCO have been invaluable in helping me refine my research and transform this personal mission into a project that could make a real difference. I have learned not only how to improve my research but also how to think critically, solve problems creatively, and pursue ideas with impact in mind. Connecting with students from around the world, all of whom share the same curiosity and drive, has been incredibly motivating and has reminded me of the power of community and shared passion. Every step of the process, from submitting my proposal to refining my project and learning from mentors, has strengthened my confidence and deepened my commitment to using my experiences to help others. IARCO has offered me more than just a competition. It has given me a space to dream, to challenge myself, and to turn a personal struggle into a purpose-driven mission. I am profoundly grateful for this opportunity, and I know it will remain one of the most meaningful experiences of my academic journey. Most importantly, it has brought me closer to my goal of preventing others from facing the hardships I endured, a mission I hope will create lasting impact."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/ThuyTienguyen.jpeg",
        "name": "Nguyen Thi Thuy Tien",
        "institution": "VNUHCM – University of Social Sciences and Humanities",
        "category": "Senior",
        "country": "Vietnam",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO 2025 was a wonderful experience, a perfect “guided research pathway”. I would like to thank the Organizing Committee and the advisors and experts who accompanied me. The knowledge and skills gained from this competition will certainly be a solid foundation for my academic journey and future career as well as that of many other contestants."
    },
    {
        "image": "https://iarco.org/assets/participant/2025/KagisoMahlati.jpeg",
        "name": "Ayola Kagiso Mahlati",
        "institution": "St Stithians Boys' College",
        "category": "Junior",
        "country": "South Africa",
        "year": "2025",
        "result": "Finalist",
        "rating": 5,
        "review": "IARCO provides an incredible platform for students from all disciplines to showcase their research potential on a global stage. What makes the experience unique is the emphasis on originality, creativity, and real-world impact, while still holding us to rigorous academic standards such as the IEEE referencing style. The structured rubric guided me to think critically about every stage of my proposal-from identifying a clear research problem to grounding it in existing literature and laying out a detailed methodology. I also appreciated how accessible the competition is: students across the humanities, STEM, and other fields can all contribute ideas that matter. IARCO doesn’t just feel like a competition-it feels like a launchpad for young researchers. It pushes you to refine your academic writing, encourages interdisciplinary thinking, and gives you the opportunity to address pressing global issues through research. ⭐️⭐️⭐️⭐️⭐️ (5/5)\r\nHighly recommended to any student who wants to challenge themselves and make their research ideas heard on an international platform."
    },
  {
    "image": "https://iarco.org/assets/participant/2024/ShafiBinSultan.jpg",
    "name": "Shafi Bin Sultan",
    "institution": "St.Joseph Higher Secondary School & College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Gold Medalist",
    "rating": 5,
    "review": "The journey with IARCO has been nothing short of transformational, with opened doors that I never thought possible, encouraging us to excel in every step through bootcamp sessions. It provided me a ground to showcase my abilities, challenged me for critical thinking, and aspired me to aim higher. I am eternally grateful that I can be in a place to share my experiences and contribute to encouraging others, because by now, too, I've been encouraged enough by the stories of so many before me. Long story short, Hats off to IARCO!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/adira.jpg",
    "name": "Adira Safwan",
    "institution": "Maple Leaf International School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Silver Medalist",
    "rating": 5,
    "review": "As the Silver Prize winner of IARCO 2024, I am immensely grateful for the incredible opportunity to practice and showcase everything I had learned, especially from the Youth Research Journal program I was a student of prior. Participating in this competition significantly honed my research skills, and the excellent workshops conducted by some of the brightest minds in the field were instrumental in my success. The event was very well-structured, with concise and detailed guidelines, ensuring that every resource we needed was readily available--- from guidelines, lectures and even examples of what was expected of us as participants. This inclusive approach made it accessible even for participants with little to no prior experience in research, encouraging everyone to give it a shot. One of the most exciting parts of the competition for me was creating the video pitch. It allowed me to present the significance of my chosen topic and put into practice everything I had worked on in my proposal. It was a perfect opportunity to merge creativity with research and demonstrate my insights in a compelling way. Truthfully, I tend to work last-minute, and there were moments when I doubted whether I’d even make it to the top 10. Winning Silver felt surreal and deeply rewarding. I am endlessly thankful to IARCO for providing this platform. I hope this inspires others to step out of their comfort zones and explore the exciting world of research."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/FilzahDahiyah.jpeg",
    "name": "Andi Filzah Dahiyah Liana",
    "institution": "Man 2 Kota Makassar",
    "category": "Junior",
    "country": "Indonesia",
    "year": "2024",
    "rating": 5,
    "result": "Bronze Medalist",
    "review": "Participating in IARCO 2024 has been an incredibly valuable and meaningful experience for me. The event was well organized, and I truly appreciate the opportunity to showcase my research and connect with other brilliant minds from various fields. Receiving the certificate of recognition was an honor, and it motivates me to continue striving for excellence in research. The supportive and professional atmosphere created by the organizers made the entire process smooth and enjoyable. I believe IARCO has a significant positive impact by inspiring researchers and fostering innovation. Thank you for hosting such an inspiring event, and I hope IARCO continues to thrive and support many more researchers in the future."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/SanjanaHasan.png",
    "name": "Sanjana Hasan",
    "institution": "Khulna University of Engineering & Technology",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Gold Medalist",
    "rating": 5,
    "review": "No matter how many lemons life gives you, keep making lemonade with a smile. There will be moments when it feels overwhelming and others that fill you with joy—that’s the nature of life. Be grateful not only for what you’ve achieved but also for what you haven’t, as it may not have been meant for you. Gratitude and forgiveness go hand in hand. Show kindness and compassion because you never truly know what others are going through. Even if you reach great heights, remain humble and treat everyone with respect. Life will bring new people and experiences your way—welcome them and learn from each one. Mistakes are not reasons for grief; they are valuable lessons. If you act unjustly or behave rudely toward someone, sincerely apologize without delay. Remember, it’s not your achievements but your behavior that truly defines your character. And lastly, never forget—no matter what challenges come your way, you must keep going. Never give up."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/EbtisamJawad.jpeg",
    "name": "Mohammad Ebtisam Jawad",
    "institution": "Premier University, Chittagong",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Silver Medalist",
    "rating": 5,
    "review": "Participating in the 'International Academic Research Competition' was a learning session in my life. I took it as a challenge to see my capabilities. In my IARCO journey, I learnt a lot from Azmain bhaiya and Sanaul bhaiya. A big congratulations to the whole IARCO team for arranging this competition successfully. I always believe, The result is not in my hand, but how much effort and dedication should be given is always in my hand."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ARLisan.JPG",
    "name": "Arafat Rahman",
    "institution": "American International University Bangladesh",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Bronze Medalist",
    "rating": 5,
    "review": "I’m honored to have my journey featured by IARCO! Participating in the research proposal competition was a challenging yet rewarding experience. Finishing 3rd was a proud moment, as it reflected my dedication and hard work. IARCO provided me with an incredible platform to showcase my ideas and grow both personally and professionally. Their support and encouragement motivated me to push my limits and think creatively. I hope my story inspires others to take on challenges and make the most of the opportunities around them. Thank you, IARCO, for being a part of my journey!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ApurboKumar.jpg",
    "name": "APURBO KUMAR",
    "institution": "Bangladesh University of Engineering and Technology",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Excellent"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/AfiaAnjumAboni.jpg",
    "name": "Afia Anjum Aboni",
    "institution": "Rajuk Uttara Model College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "By doing the IARCO boot camp, I learned about the procedure of doing research comprehensibly. Our mentor was very insightful and patient as he diligently led us through the research steps. As an absolute beginner, I now have a clear roadmap of the things I need to do or avoid when I think of starting my research paper!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/Ha-mimRahman.jpg",
    "name": "Ha-mim Rahman",
    "institution": "Notre Dame College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "The program has been awesome overall."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/Hossain_ Siam.png",
    "name": "Md Siam Hossain",
    "institution": "University of Dhaka",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "I’ve learned so much throughout this process. Writing a research proposal is not something typically covered in our universities, so this boot camp has been invaluable. It provided me with the opportunity to learn essential techniques from a qualified instructor and offered insights into managing a PhD effectively. I truly appreciate what IARCO is doing to support us in this journey."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/LamisaManha.jpg",
    "name": "Lamisa Manha Aditee",
    "institution": "BRAC University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "Creating a research proposal is the first step to do start a research project. I’m glad that I decided to participate in IARCO, as it has given me a clear understanding of how to get started in research. Coming from a STEM background, this experience has been especially helpful for me."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/IshmamHaque.jpeg",
    "name": "SM Ishmam Tahsin Haque",
    "institution": "Maple Leaf International School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "IARCO helped me delve deeper into understanding the process of writing a presenting a research proposal and simultaneously competing with other talented participants."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/TAZRIANISLAMSUBHA.jpeg",
    "name": "Tazrian Islam Subha",
    "institution": "South Breeze School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "It helped me gain lots of insights on how to write a research proposal. All information was really amazing and crucial for my future studies. I loved the boot camps."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/XeonNasif.jpg",
    "name": "Xeon Nasif",
    "institution": "Notre Dame College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "The lessons have undoubtedly provided us with the necessary skills to write research proposals effectively."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/EshratJahan.jpg",
    "name": "Eshrat Jahan",
    "institution": "University of Dhaka",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Educative and well organised."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/GloryJewel.jpg",
    "name": "Glory Jewel",
    "institution": "Mohammadpur Preparatory School And College",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "As I had an desire for researching. It helped me to get an idea about the research proposal . Really enjoyed to hear from the experienced persons."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/CarolineGomes.jpg",
    "name": "Caroline Gomes",
    "institution": "University of Dhaka",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO bootcamp has helped me a lot to get deep insights into the world of research. I have learnt the basics of research. For example, how to write a research proposal, the methodology of research. The best part of this event was the study abroad part."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/sanjidaafrin.jpg",
    "name": "Sanjida Afrin",
    "institution": "Bangladesh University of Engineering & Technology (BUET)",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "This bootcamp is very organized. It helps me understand and find some significant issues which will help me regarding research."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/sameerakhan.jpeg",
    "name": "Sameera Khan",
    "institution": "Notre Dame University Bangladesh",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "Joining the IARCO Bootcamp  not only did it deepen my understanding of research proposal but it also equipped me with practical skills that I’m already applying in my studies. "
  },
  {
    "image": "https://iarco.org/assets/participant/2024/TafhimIslam.jpg",
    "name": "Tafhim Islam",
    "institution": "Saint Joseph Higher Secondary School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO taught me the basics of research and it initiated me on learning through papers and journals. I would love to be with the youth research journal in future. I also want to thank everyone including the organizer, the lecturers and other persons involved for their earnest efforts. "
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ZubairMustafa.jpg",
    "name": "Zubair Mustafa",
    "institution": "Daffodil International University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "I just loved YRJ how they have organized the things hats off!!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/UmaizaJaveria.jpg",
    "name": "Umaiza Javeria",
    "institution": "William Carey Academy",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "The IARCO bootcamp helped me the learn fundamentals of research and what it really is. It also cleared a lot of misconceptions surrounding research and who can do it. "
  },
  {
    "image": "https://iarco.org/assets/participant/2024/MahiyaMannan.jpg",
    "name": "Mahiya Mannan",
    "institution": "Heritage School",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO Bootcamp was an amazing experience!  Learned soo much"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/UmmeyZahida.jpg",
    "name": "Ummey Zahida",
    "institution": "University of Chittagong ",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Excellent initiative to aware students about research and related things with."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/NazmoonNahar.jpg",
    "name": "Nazmoon Nahar",
    "institution": "Sher-e-Bangla Agricultural University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "IARCO bootcamp is a great initiative to encourage the students about research. It is not only a competition but also a platform to learn the all of the basic of research and find out all the curious question about research. By writing a proposal, anyone can be more confident with practical learning and able to do a better future researcher."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/TriprantaSaha.jpg",
    "name": "Tripranta Saha",
    "institution": "American International University",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Yes, that was great. Through this bootcamp, I got more information about research and found my interest."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/JAYEETABISWAS.jpg",
    "name": "Jayeeta Biswas",
    "institution": "Khulna University of Engineering and Technology",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 5,
    "review": "Yes, the IARCO Bootcamp would be a great fit for you! Even as if I'm new to research proposals, the bootcamp is designed to guide beginners through the process. It typically covers all the essentials, like understanding research structure, setting clear objectives, and organizing your ideas effectively.It was instrumental in building my research skills. Through structured sessions, I learned how to effectively conduct research, critically analyze information, and develop well-organized research proposals. The guidance on proposal writing, from framing research questions to setting clear objectives, was invaluable. Highly recommended for anyone looking to deepen their research skills and learn the art of proposal writing!"
  },
  {
    "image": "https://iarco.org/assets/participant/2024/SarhanAlamKhan.jpeg",
    "name": "Sarhan Alam Khan",
    "institution": "Scholastica",
    "category": "Junior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "The bootcamps was quite informative. I loved how they record each of their sessions and give the resources related to research. This is a  life long learning experience."
  },
  {
    "image": "https://iarco.org/assets/participant/2024/ManjaryHowlader.jpg",
    "name": "Manjary Howlader",
    "institution": "Viqarunnisa Noon School & College",
    "category": "Senior",
    "country": "Bangladesh",
    "year": "2024",
   "result": "Finalist",
    "rating": 4,
    "review": "As someone who felt overwhelmed by the abundant research-related materials available online, the bootcamp was very concise and easy to understand."
  }
]
